---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.SpaceLoadClass
source: html/514b8c66-dffc-aef1-cb67-0e2f52f9340f.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.SpaceLoadClass Property

The electrical load class associated with a space.

## Syntax (C#)
```csharp
public ElectricalLoadClassificationSpace SpaceLoadClass { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration